1.write a pandas progam to create and display a one dimen array like object contaning an array of data using pandas module

In [1]:
import numpy as np

In [2]:
a=np.arange(1,11)

In [3]:
a

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [4]:
import pandas as pd
c=pd.Series(a)
c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

2.write a pandas progm to convert a pandas module series to pytho list and its type

In [5]:
list1=[1,5,3,8,1,4,2,6]
d=pd.Series(list1)
d

0    1
1    5
2    3
3    8
4    1
5    4
6    2
7    6
dtype: int64

3.ADD ,SUBTRACT AND DIV

In [6]:
list2=[1,5,3,6,47,8]
list3=[5,6,1,36,45,8]
g=pd.Series(list2)
g

0     1
1     5
2     3
3     6
4    47
5     8
dtype: int64

In [7]:
f=pd.Series(list3)

In [8]:
f

0     5
1     6
2     1
3    36
4    45
5     8
dtype: int64

In [9]:
g-f

0    -4
1    -1
2     2
3   -30
4     2
5     0
dtype: int64

In [10]:
f*g

0       5
1      30
2       3
3     216
4    2115
5      64
dtype: int64

In [11]:
f/g

0    5.000000
1    1.200000
2    0.333333
3    6.000000
4    0.957447
5    1.000000
dtype: float64

In [12]:
g+f

0     6
1    11
2     4
3    42
4    92
5    16
dtype: int64

5.dict to pandas

In [13]:
has={'a':100,'b':200,'c':300,'d':400,'e':800}

In [14]:
ab=pd.Series(has)
ab

a    100
b    200
c    300
d    400
e    800
dtype: int64

6.numpy array to pandas series

In [15]:
m=np.arange(10,60,step=10)
m
ha=pd.Series(m)
ha

0    10
1    20
2    30
3    40
4    50
dtype: int32

4.compare series

In [16]:
g<f

0     True
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [17]:
g>f

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [18]:
g==f

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [19]:
g>=f

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [20]:
g<=f

0     True
1     True
2    False
3     True
4    False
5     True
dtype: bool

In [21]:
g!=f

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [22]:
list1=[100,200,"python",300.12,400]
hu=pd.Series(list1)
hu

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [23]:
hu.isna()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [24]:
hu[hu.isna()]

Series([], dtype: object)

In [25]:
hy=pd.to_numeric(hu,errors='coerce')

In [26]:
hy

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

8.pandas progm to sort a given series

In [27]:
list1=[100,20,500,86]
ki=pd.Series(list1)
ki
ki=pd.Series(list1).sort_values()
ki

1     20
3     86
0    100
2    500
dtype: int64

In [28]:
marksheet={"Name":["David","Richard","john","Tony","scott"],"Maths":[85,91,81,84,71],"Science":[87,81,86,86,79],"English":[88,78,88,87,82],"Physics":[92,71,84,82,88],"General Knowlege":[88,74,82,81,99]}

In [29]:
marksheet1=pd.DataFrame(marksheet)

In [30]:
marksheet1

      Name  Maths  Science  English  Physics  General Knowlege
0    David     85       87       88       92                88
1  Richard     91       81       78       71                74
2     john     81       86       88       84                82
3     Tony     84       86       87       82                81
4    scott     71       79       82       88                99

In [31]:
marksheet1["Total mark"]=marksheet1["Maths"]+marksheet1["Science"]+marksheet1["English"]+marksheet["Physics"]+marksheet1["General Knowlege"]

In [32]:
marksheet1

      Name  Maths  Science  English  Physics  General Knowlege  Total mark
0    David     85       87       88       92                88         440
1  Richard     91       81       78       71                74         395
2     john     81       86       88       84                82         421
3     Tony     84       86       87       82                81         420
4    scott     71       79       82       88                99         419

In [33]:
marksheet1["Average"]=marksheet1["Total mark"]/500

In [34]:
marksheet1

,Name,Maths,Science,English,Physics,General Knowlege,Total mark,Average
0,David,85,87,88,92,88,440,0.880
1,Richard,91,81,78,71,74,395,0.790
2,john,81,86,88,84,82,421,0.842
3,Tony,84,86,87,82,81,420,0.840
4,scott,71,79,82,88,99,419,0.838

In [35]:
marksheet1["cgpa"]=marksheet1["Total mark"]/50

In [36]:
marksheet1

,Name,Maths,Science,English,Physics,General Knowlege,Total mark,Average,cgpa
0,David,85,87,88,92,88,440,0.880,8.80
1,Richard,91,81,78,71,74,395,0.790,7.90
2,john,81,86,88,84,82,421,0.842,8.42
3,Tony,84,86,87,82,81,420,0.840,8.40
4,scott,71,79,82,88,99,419,0.838,8.38

In [37]:
marksheet1["percentage"]=marksheet1["Average"]*100

In [38]:
marksheet1

,Name,Maths,Science,English,Physics,General Knowlege,Total mark,Average,cgpa,percentage
0,David,85,87,88,92,88,440,0.880,8.80,88.0
1,Richard,91,81,78,71,74,395,0.790,7.90,79.0
2,john,81,86,88,84,82,421,0.842,8.42,84.2
3,Tony,84,86,87,82,81,420,0.840,8.40,84.0
4,scott,71,79,82,88,99,419,0.838,8.38,83.8

# reading a file

In [40]:
marksheet2=pd.read_excel(r"C:\Users\admin\Documents\haseeb pandas\Mrks_data (1).xlsx")

In [42]:
marksheet2

        Name  Age        City Qualification
0       Amal    22     Kannur           PHD
1       Ammu    26       Pmna      Plus two
2       Arya    24   Thrissur        Degree
3    Sreeraj    22  Kozhikode           BBA
4  Arundathi    21        Ekm           BCA
5      Vipin    25    Shornur            BA
6     Nithin    22   Nilambur           Bsc
7      Karun    23  Kozhikode           Bsc

In [43]:
marksheet3=pd.read_excel(r"C:\Users\admin\Documents\haseeb pandas\Mrks_data (1).xlsx",sheet_name=["DA1","DA2"])

In [44]:
marksheet3

{'DA1':         Name  Age        City Qualification
 0       Amal    22     Kannur           PHD
 1       Ammu    26       Pmna      Plus two
 2       Arya    24   Thrissur        Degree
 3    Sreeraj    22  Kozhikode           BBA
 4  Arundathi    21        Ekm           BCA
 5      Vipin    25    Shornur            BA
 6     Nithin    22   Nilambur           Bsc
 7      Karun    23  Kozhikode           Bsc,
 'DA2':       Name  Age         City Qualification
 0   Anagha    22      Kannur      Plus two
 1     Anil    20  Trivandrum        Degree
 2     Diya    25   Kozhikode           BCA
 3    Deepa    24    Palakkad           BBA
 4   Nalini    23        Pmna           MCA
 5  Adithya    22    Thrissur           PHD}

In [47]:
iris=pd.read_excel(r"C:\Users\admin\Documents\haseeb pandas\iris (1).xls")

In [48]:
iris

      SL   SW   PL   PW  Classification
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    NaN  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  NaN  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [49]:
iris.head(10)

    SL   SW   PL   PW Classification
0  5.1  3.5  1.4  0.2    Iris-setosa
1  4.9  3.0  1.4  0.2    Iris-setosa
2  NaN  3.2  1.3  0.2    Iris-setosa
3  4.6  3.1  1.5  0.2    Iris-setosa
4  5.0  3.6  1.4  0.2    Iris-setosa
5  5.4  3.9  1.7  0.4    Iris-setosa
6  4.6  3.4  1.4  0.3    Iris-setosa
7  5.0  3.4  1.5  0.2    Iris-setosa
8  4.4  2.9  1.4  0.2    Iris-setosa
9  4.9  3.1  1.5  0.1    Iris-setosa

In [50]:
iris.tail(10)

      SL   SW   PL   PW  Classification
140  6.7  3.1  5.6  2.4  Iris-virginica
141  NaN  3.1  5.1  2.3  Iris-virginica
142  5.8  2.7  5.1  1.9  Iris-virginica
143  6.8  3.2  5.9  2.3  Iris-virginica
144  6.7  3.3  5.7  2.5  Iris-virginica
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  NaN  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [52]:
iris.isna()

        SL     SW     PL     PW  Classification
0    False  False  False  False           False
1    False  False  False  False           False
2     True  False  False  False           False
3    False  False  False  False           False
4    False  False  False  False           False
..     ...    ...    ...    ...             ...
145  False  False  False  False           False
146  False  False  False  False           False
147  False  False   True  False           False
148  False  False  False  False           False
149  False  False  False  False           False

[150 rows x 5 columns]

In [57]:
iris.isna().sum()

SL                7
SW                6
PL                6
PW                0
Classification    0
dtype: int64

In [59]:
iris["PL"].isna()

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147     True
148    False
149    False
Name: PL, Length: 150, dtype: bool

In [60]:
iris[iris["PL"].isna()]

      SL   SW  PL   PW   Classification
28   5.2  3.4 NaN  0.2      Iris-setosa
42   4.4  3.2 NaN  0.2      Iris-setosa
56   6.3  3.3 NaN  1.6  Iris-versicolor
94   5.6  2.7 NaN  1.3  Iris-versicolor
109  7.2  3.6 NaN  2.5   Iris-virginica
147  6.5  3.0 NaN  2.0   Iris-virginica

In [61]:
iris["SW"].isna()

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: SW, Length: 150, dtype: bool

In [63]:
iris[iris["SW"].isna()]

      SL  SW   PL   PW   Classification
10   5.4 NaN  1.5  0.2      Iris-setosa
27   5.2 NaN  1.5  0.2      Iris-setosa
43   5.0 NaN  1.6  0.6      Iris-setosa
72   6.3 NaN  4.9  1.5  Iris-versicolor
98   5.1 NaN  3.0  1.1  Iris-versicolor
124  6.7 NaN  5.7  2.1   Iris-virginica